DataProcessors/ЗагрузкаМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаМероприятий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗагрузкиМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ЗагрузкаМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗагрузкаМероприятий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ХранилищеДанныхТабличныхДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗагрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗагрузкиМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаМероприятий/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	НачатьТранзакцию();
	Попытка
		тзДанные = РеквизитФормыВЗначение("тзДанные");
		
		Документ = Документы.ЗагрузкаМероприятий.СоздатьДокумент();
		Документ.Организация = ПараметрыСеанса.ТекущийПользователь.Организация;
		Документ.Автор = ПараметрыСеанса.ТекущийПользователь;
		Документ.НастройкаЗагрузки = Объект.НастройкаЗагрузки;
		Документ.Дата = ТекущаяДата();
		Документ.ЗаписатьСодержимоеХранилищаТЗДанных(тзДанные);
		Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		УправлениеЗагрузкамиДанных.ПоместитьТабличнуюЧастьВХранилище(ПолеИсходнойТаблицы, Документ.Ссылка);
		
		Для Каждого Стр Из тзДанные Цикл
			Мероприятие = Задачи.Мероприятие.СоздатьЗадачу();
			Мероприятие.Объект = Стр.ОбъектМероприятия;
			Мероприятие.ТипМероприятия = Объект.НастройкаЗагрузки.ТипМероприятия;
			Мероприятие.Результат = Объект.НастройкаЗагрузки.РезультатПоУмолчанию;
			Мероприятие.ПланируемаяДата = Стр.ОбъектДата;
			Мероприятие.Дата = Стр.ОбъектДата;
			Мероприятие.ДатаВыполнения = Стр.ОбъектДата;
			Мероприятие.ФактическаяДата = Стр.ОбъектДата;
			Мероприятие.Автор = Документ.Ссылка;
			Мероприятие.Организация = ПараметрыСеанса.ТекущийПользователь.Организация;
			Мероприятие.Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
			Мероприятие.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
			Мероприятие.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			Мероприятие.Комментарий = Стр.ОбъектКомментарий;
			Для Каждого Элемент Из Объект.НастройкаЗагрузки.ДополнительныеРеквизиты Цикл
				Строка = Мероприятие.ДополнительныеРеквизиты.Добавить();
				Строка.Свойство = Элемент.Свойство;
				Строка.Значение = стр["ДополнительныйРеквизит_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_")]
			КонецЦикла;
			Мероприятие.Выполнена = Истина;
			Мероприятие.Записать();
		КонецЦикла;
		Сообщить("Загрузка мероприятий успешно выполнена!");
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить("При загрузке мероприятий произошла ошибка!");
		Сообщить(ОписаниеОшибки());
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	ВыполнитьЗагрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспознатьНаСервере()
	Попытка
		КолонкиТаблицыЦенДоб = Новый Массив;
		КолонкиТаблицыЦенДоб.Добавить("тзДанные");
		ЭтаФорма.ИзменитьРеквизиты(,КолонкиТаблицыЦенДоб);
	Исключение
//		Сообщить("ааа");
	КонецПопытки;
	
	Попытка
		Элементы.Удалить(Элементы["тзДанные"]);
	Исключение
//		Сообщить("ббб");
	КонецПопытки;
	
	
	Реквизит = Новый РеквизитФормы("тзДанные", Новый ОписаниеТипов("ТаблицаЗначений"), "", "тзДанные");
	КолонкиТаблицыЦенДоб = Новый Массив;
	КолонкиТаблицыЦенДоб.Добавить(Реквизит);
	ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);

	ПолеТаблицы = Элементы.Добавить("тзДанные", Тип("ТаблицаФормы"), Элементы.ГруппаДанные);
	ПолеТаблицы.ПутьКДанным = "тзДанные";
	ПолеТаблицы.ИзменятьПорядокСтрок = Ложь;
	ПолеТаблицы.ИзменятьСоставСтрок = Ложь;
	
	
	РеквизитНомерСтроки = Новый РеквизитФормы("НомерСтроки", Новый Описаниетипов("Число"), "тзДанные", "N");
	КолонкиТаблицыЦенДоб = Новый Массив;
	КолонкиТаблицыЦенДоб.Добавить(РеквизитНомерСтроки);
	ПолеФормы = Элементы.Добавить("тзДанныеНомерСтроки", Тип("ПолеФормы"), Элементы["тзДанные"]);
	ПолеФормы.Заголовок = "N";
	ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);
	
	Попытка		
		ПолеФормы.ПутьКДанным = "тзДанные.НомерСтроки";			
	Исключение
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода;
	
	//2 Добавляем колонку в таблицу тзДанные
	Имя = "ОбъектМероприятия";
	Синоним = "Объект";
	ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ДолговыеОбязательства");
	
	Реквизит = Новый РеквизитФормы(Имя, ТипЗначения, "тзДанные", Синоним);
	КолонкиТаблицыЦенДоб = Новый Массив;
	КолонкиТаблицыЦенДоб.Добавить(Реквизит);
	
	ПолеФормы = Элементы.Добавить("тзДанные" + Имя, Тип("ПолеФормы"), Элементы["тзДанные"]);
	ПолеФормы.Заголовок = Синоним;
	ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);
	
	Попытка		
		ПолеФормы.ПутьКДанным = "тзДанные." + Имя;			
	Исключение
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода; 		
	
	Имя = "ОбъектДата";
	Синоним = "Дата";
	ТипЗначения = Новый ОписаниеТипов("Дата");
	
	Реквизит = Новый РеквизитФормы(Имя, ТипЗначения, "тзДанные", Синоним);
	КолонкиТаблицыЦенДоб = Новый Массив;
	КолонкиТаблицыЦенДоб.Добавить(Реквизит);
	
	ПолеФормы = Элементы.Добавить("тзДанные" + Имя, Тип("ПолеФормы"), Элементы["тзДанные"]);
	ПолеФормы.Заголовок = Синоним;
	ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);
	
	Попытка		
		ПолеФормы.ПутьКДанным = "тзДанные." + Имя;			
	Исключение
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода; 	
	
	
	Имя = "ОбъектКомментарий";
	Синоним = "Комментарий";
	ТипЗначения = Новый ОписаниеТипов("Строка");
	
	Реквизит = Новый РеквизитФормы(Имя, ТипЗначения, "тзДанные", Синоним);
	КолонкиТаблицыЦенДоб = Новый Массив;
	КолонкиТаблицыЦенДоб.Добавить(Реквизит);
	
	ПолеФормы = Элементы.Добавить("тзДанные" + Имя, Тип("ПолеФормы"), Элементы["тзДанные"]);
	ПолеФормы.Заголовок = Синоним;
	ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);
	
	Попытка		
		ПолеФормы.ПутьКДанным = "тзДанные." + Имя;			
	Исключение
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода; 
	
	Для Каждого Элемент Из Объект.НастройкаЗагрузки.ДополнительныеРеквизиты Цикл
		Имя = "ДополнительныйРеквизит_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_");
		Синоним = Элемент.Свойство.Наименование;
		ТипЗначения = Элемент.Свойство.ТипЗначения;
		
		Реквизит = Новый РеквизитФормы(Имя, ТипЗначения, "тзДанные", Синоним);
		КолонкиТаблицыЦенДоб = Новый Массив;
		КолонкиТаблицыЦенДоб.Добавить(Реквизит);
		
		ПолеФормы = Элементы.Добавить("тзДанные" + Имя, Тип("ПолеФормы"), Элементы["тзДанные"]);
		ПолеФормы.Заголовок = Синоним;
		ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);
		
		Попытка		
			ПолеФормы.ПутьКДанным = "тзДанные." + Имя;			
		Исключение
			Сообщить(ОписаниеОшибки());		
		КонецПопытки;
		ПолеФормы.Вид = ВидПоляФормы.ПолеВвода; 
	КонецЦикла;
	
	//Для Каждого Элемент Из Объект.НастройкаСоответствий Цикл
	//	Имя = СтрЗаменить(Строка(Элемент.Назначение)," ", "") + "_" + СтрЗаменить(Строка(Элемент.ВидРеквизита), " ", "") + "_" + СтрЗаменить(Строка(Элемент.КодСвойства), " ", "_");
	//	Синоним = Элемент.ИмяСвойства;
	//	Если Элемент.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.Код") Тогда
	//		ТипЗначения = Новый ОписаниеТипов("Строка");
	//	ИначеЕсли Элемент.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.Наименование") Тогда
	//		ТипЗначения = Новый ОписаниеТипов("Строка");
	//	ИначеЕсли Элемент.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.Процедура") Тогда
	//		ТипЗначения = Новый ОписаниеТипов("Строка");
	//	ИначеЕсли Элемент.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.ДополнительноеСведение") ИЛИ Элемент.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.ДополнительныйРеквизит") Тогда
	//		ТипЗначения = НайтиТипПВХ(Элемент.КодСвойства);
	//	ИначеЕсли Элемент.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.ОтветственныйСотрудник") Тогда
	//		ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
	//	ИначеЕсли Элемент.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.ТипЗадолженности") ИЛИ Элемент.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитов.ТипОбъекта") Тогда
	//		ТипЗначения = Новый ОписаниеТипов(СтрЗаменить(СтрЗаменить(Элемент.ТипДанных, ":", "."), " ", ""));
	//	КонецЕсли;
	//		
	//		
	//	//2 Добавляем колонку в таблицу тзДанные
	//	Реквизит = Новый РеквизитФормы(Имя, ТипЗначения, "тзДанные", Синоним);
	//	//РеквизитНомерСтроки = Новый РеквизитФормы("НомерСтроки", Новый Описаниетипов("Число"), "тзДанные", "N");
	//	КолонкиТаблицыЦенДоб = Новый Массив;
	//	КолонкиТаблицыЦенДоб.Добавить(Реквизит);
	//	
	//	ПолеФормы = Элементы.Добавить("тзДанные" + Имя, Тип("ПолеФормы"), Элементы["тзДанные"]);
	//	ПолеФормы.Заголовок = Синоним;
	//	ЭтаФорма.ИзменитьРеквизиты(КолонкиТаблицыЦенДоб);
	//	
	//	Попытка		
	//		ПолеФормы.ПутьКДанным = "тзДанные." + Имя;			
	//	Исключение
	//		Сообщить(ОписаниеОшибки());		
	//	КонецПопытки;
	//	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода; 		
	//КонецЦикла;
 
	Мегазагрузка(РеквизитФормыВЗначение("тзДанные"));

КонецПроцедуры

&НаКлиенте
Процедура Распознать(Команда)
	РаспознатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура Мегазагрузка(тзДанные);
	//ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	//ОписаниеТиповДата = Новый ОписаниеТипов("Дата");
	//ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	Таб = РеквизитФормыВЗначение("тзДанные");
	Для НомерСтроки = 2 По ПолеИсходнойТаблицы.ВысотаТаблицы Цикл		
		НоваяСтрока = Таб.Добавить();
		НоваяСтрока.НомерСтроки = НомерСтроки - 1;
		НоваяСтрока["ОбъектМероприятия"] = Справочники.ДолговыеОбязательства.НайтиПоРеквизиту("КодДО", ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(Объект.НастройкаЗагрузки.ОбъектСтолбец, "ЧГ=")).Текст);
		стрДата = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(Объект.НастройкаЗагрузки.ОбъектДата, "ЧГ=")).Текст;
		Попытка
			НоваяСтрока["ОбъектДата"] = Дата(стрДата);
		Исключение
			НоваяСтрока["ОбъектДата"] = Технический.ПреобразоватьДату(стрДата);
		КонецПопытки;
		НоваяСтрока["ОбъектКомментарий"] = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(Объект.НастройкаЗагрузки.ОбъектКомментарий, "ЧГ=")).Текст;

		Для Каждого Элемент Из Объект.НастройкаЗагрузки.ДополнительныеРеквизиты Цикл
			стр = ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтроки, "ЧГ=") + "C" + Формат(Элемент.НомерСтолбца, "ЧГ=")).Текст;
			Если Строка(Элемент.Свойство.ТипЗначения) = "Строка" Тогда
				Значение = стр;
			ИначеЕсли Строка(Элемент.Свойство.ТипЗначения) = "Дата" Тогда
				Попытка
					Значение = Дата(стр);
				Исключение
					Значение = Технический.ПреобразоватьДату(стр);
				КонецПопытки;
			ИначеЕсли Строка(Элемент.Свойство.ТипЗначения) = "Число" Тогда
				Попытка 
					Значение = Число(стр);
				Исключение
					Значение = 0;
				КонецПопытки;
			Иначе 
				Значение = Неопределено;
			КонецЕсли;
			Если Значение <> Неопределено Тогда
				НоваяСтрока["ДополнительныйРеквизит_" + СтрЗаменить(Элемент.Свойство.Код, " ", "_")] = Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	
	//ЗаполнитьДанные(тзДанные);	 

	//ЗаполнитьДанные1(тзДанные);
	//Таб = РеквизитФормыВЗначение("тзДанные");
	//Кол = Таб.Количество() - 1;
	//Для н = 0 По Кол Цикл
	//	//Стр = тзДанные[н];
	//	ПустаяСтрокаТаблицы = Истина;
	//	Для Номер = 1 По ПолеИсходнойТаблицы.ШиринаТаблицы Цикл
	//		Если ЗначениеЗаполнено(ПолеИсходнойТаблицы.Область("R" + Формат(Кол-н+2, "ЧГ=") + "C" + 
	//			Формат(Номер, "ЧГ=")).Текст) Тогда
	//			ПустаяСтрокаТаблицы = Ложь;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если ПустаяСтрокаТаблицы Тогда
	//		Таб.Удалить(Кол-н);
	//	КонецЕсли;
	//КонецЦикла;
	ЗначениеВРеквизитФормы(Таб, "тзДанные");

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если Вебклиент Тогда
		Элементы.ПолеИсходнойТаблицы.ОтображатьЗаголовки = Ложь;
		Элементы.ПолеИсходнойТаблицы.ОтображатьСетку = Ложь;
	#КонецЕсли
КонецПроцедуры
